zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/atsamd51/atsamd51n19a-pinctrl.h
/* pb16i_sdhc1_sdcd */
#define PB16I_SDHC1_SDCD MCHP_PINMUX(b, 16, i, periph)

/* pb16j_i2s_sck0 */
#define PB16J_I2S_SCK0 MCHP_PINMUX(b, 16, j, periph)

/* pb16m_gclk_io2 */
#define PB16M_GCLK_IO2 MCHP_PINMUX(b, 16, m, periph)

/* pb16n_ccl_in11 */
#define PB16N_CCL_IN11 MCHP_PINMUX(b, 16, n, periph)

/* pb17_gpio */
#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 MCHP_PINMUX(b, 17, a, periph)

/* pb17c_sercom5_pad1 */
#define PB17C_SERCOM5_PAD1 MCHP_PINMUX(b, 17, c, periph)

/* pb17e_tc6_wo1 */
#define PB17E_TC6_WO1 MCHP_PINMUX(b, 17, e, periph)

/* pb17f_tcc3_wo1 */
#define PB17F_TCC3_WO1 MCHP_PINMUX(b, 17, f, periph)

/* pb17g_tcc0_wo5 */
#define PB17G_TCC0_WO5 MCHP_PINMUX(b, 17, g, periph)

/* pb17i_sdhc1_sdwp */
#define PB17I_SDHC1_SDWP MCHP_PINMUX(b, 17, i, periph)

/* pb17j_i2s_mck0 */
#define PB17J_I2S_MCK0 MCHP_PINMUX(b, 17, j, periph)

/* pb17m_gclk_io3 */
#define PB17M_GCLK_IO3 MCHP_PINMUX(b, 17, m, periph)

/* pb17n_ccl_out3 */
#define PB17N_CCL_OUT3 MCHP_PINMUX(b, 17, n, periph)

/* pb18_gpio */
#define PB18_GPIO MCHP_PINMUX(b, 18, gpio, gpio)

/* pb18a_eic_extint2 */
#define PB18A_EIC_EXTINT2 MCHP_PINMUX(b, 18, a, periph)

/* pb18c_sercom5_pad2 */
#define PB18C_SERCOM5_PAD2 MCHP_PINMUX(b, 18, c, periph)

/* pb18d_sercom7_pad2 */
#define PB18D_SERCOM7_PAD2 MCHP_PINMUX(b, 18, d, periph)

/* pb18f_tcc1_wo0 */
#define PB18F_TCC1_WO0 MCHP_PINMUX(b, 18, f, periph)

/* pb18g_pdec_qdi0 */
#define PB18G_PDEC_QDI0 MCHP_PINMUX(b, 18, g, periph)

/* pb18i_sdhc1_sddat0 */
#define PB18I_SDHC1_SDDAT0 MCHP_PINMUX(b, 18, i, periph)

/* pb18m_gclk_io4 */
#define PB18M_GCLK_IO4 MCHP_PINMUX(b, 18, m, periph)

/* pb19_gpio */
#define PB19_GPIO MCHP_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 MCHP_PINMUX(b, 19, a, periph)

/* pb19c_sercom5_pad3 */
#define PB19C_SERCOM5_PAD3 MCHP_PINMUX(b, 19, c, periph)

/* pb19d_sercom7_pad3 */
#define PB19D_SERCOM7_PAD3 MCHP_PINMUX(b, 19, d, periph)

/* pb19f_tcc1_wo1 */
#define PB19F_TCC1_WO1 MCHP_PINMUX(b, 19, f, periph)

/* pb19g_pdec_qdi1 */
#define PB19G_PDEC_QDI1 MCHP_PINMUX(b, 19, g, periph)

/* pb19i_sdhc1_sddat1 */
#define PB19I_SDHC1_SDDAT1 MCHP_PINMUX(b, 19, i, periph)

/* pb19m_gclk_io5 */
#define PB19M_GCLK_IO5 MCHP_PINMUX(b, 19, m, periph)

/* pb20_gpio */
#define PB20_GPIO MCHP_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 MCHP_PINMUX(b, 20, a, periph)

/* pb20c_sercom3_pad0 */
#define PB20C_SERCOM3_PAD0 MCHP_PINMUX(b, 20, c, periph)

/* pb20d_sercom7_pad1 */
#define PB20D_SERCOM7_PAD1 MCHP_PINMUX(b, 20, d, periph)

/* pb20f_tcc1_wo2 */
#define PB20F_TCC1_WO2 MCHP_PINMUX(b, 20, f, periph)

/* pb20g_pdec_qdi2 */
#define PB20G_PDEC_QDI2 MCHP_PINMUX(b, 20, g, periph)

/* pb20i_sdhc1_sddat2 */
#define PB20I_SDHC1_SDDAT2 MCHP_PINMUX(b, 20, i, periph)

/* pb20m_gclk_io6 */
#define PB20M_GCLK_IO6 MCHP_PINMUX(b, 20, m, periph)

/* pb21_gpio */
#define PB21_GPIO MCHP_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 MCHP_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 MCHP_PINMUX(b, 21, c, periph)

/* pb21d_sercom7_pad0 */
#define PB21D_SERCOM7_PAD0 MCHP_PINMUX(b, 21, d, periph)

/* pb21f_tcc1_wo3 */
#define PB21F_TCC1_WO3 MCHP_PINMUX(b, 21, f, periph)

/* pb21i_sdhc1_sddat3 */
#define PB21I_SDHC1_SDDAT3 MCHP_PINMUX(b, 21, i, periph)

/* pb21m_gclk_io7 */
#define PB21M_GCLK_IO7 MCHP_PINMUX(b, 21, m, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 MCHP_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 MCHP_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 MCHP_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 MCHP_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof_1khz */
#define PB22H_USB_SOF_1KHZ MCHP_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 MCHP_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 MCHP_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 MCHP_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 MCHP_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 MCHP_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 MCHP_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 MCHP_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 MCHP_PINMUX(b, 23, n, periph)

/* pb24_gpio */
#define PB24_GPIO MCHP_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint8 */
#define PB24A_EIC_EXTINT8 MCHP_PINMUX(b, 24, a, periph)

/* pb24c_sercom0_pad0 */
#define PB24C_SERCOM0_PAD0 MCHP_PINMUX(b, 24, c, periph)

/* pb24d_sercom2_pad1 */
#define PB24D_SERCOM2_PAD1 MCHP_PINMUX(b, 24, d, periph)

/* pb24g_pdec_qdi1 */
#define PB24G_PDEC_QDI1 MCHP_PINMUX(b, 24, g, periph)

/* pb24m_ac_cmp0 */
#define PB24M_AC_CMP0 MCHP_PINMUX(b, 24, m, periph)

/* pb25_gpio */
#define PB25_GPIO MCHP_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint9 */
#define PB25A_EIC_EXTINT9 MCHP_PINMUX(b, 25, a, periph)

/* pb25c_sercom0_pad1 */
#define PB25C_SERCOM0_PAD1 MCHP_PINMUX(b, 25, c, periph)

/* pb25d_sercom2_pad0 */
#define PB25D_SERCOM2_PAD0 MCHP_PINMUX(b, 25, d, periph)

/* pb25g_pdec_qdi2 */
#define PB25G_PDEC_QDI2 MCHP_PINMUX(b, 25, g, periph)

/* pb25m_ac_cmp1 */
#define PB25M_AC_CMP1 MCHP_PINMUX(b, 25, m, periph)

/* pb30_gpio */
#define PB30_GPIO MCHP_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 MCHP_PINMUX(b, 30, a, periph)

/* pb30c_sercom7_pad0 */
#define PB30C_SERCOM7_PAD0 MCHP_PINMUX(b, 30, c, periph)

/* pb30d_sercom5_pad1 */
#define PB30D_SERCOM5_PAD1 MCHP_PINMUX(b, 30, d, periph)

